Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Для каждого зап из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(зап.НаименованиеШаблона) Тогда
			Отказ = Истина;
			Сообщить("Попытка записи шаблона без имени.");
			Возврат;
		КонецЕсли;
		зап.ПредставлениеUID = Строка(зап.UIDОбъекта);
		зап.ЭтоШаблоннаяСхема = РегистрыСведений.Tester_ШаблонныеДанные.ЭтоХранилищеШаблонныхДанных(зап.ХранилищеШаблонныхДанных);	
	КонецЦикла	
КонецПроцедуры	