
/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////Обработчики Событий Формы \\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Надпись = Параметры.ТекстВопроса;
	Заголовок = ?(Параметры.Свойство("ЗаголовокФормы",Заголовок),Заголовок,"Вопрос");
	//@skip-check module-unused-local-variable
	//@skip-check module-unused-local-variable
	КнопкаПоУмолчаниюНет = ?(Параметры.Свойство("КнопкаПоУмолчаниюНет",КнопкаПоУмолчаниюНет),КнопкаПоУмолчаниюНет,Истина);	
	
	ТекущийЭлемент = ?(КнопкаПоУмолчаниюНет,Элементы.НЕТ,Элементы.ДА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Активизировать();
КонецПроцедуры

#КонецОбласти


/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////Обработчики Событий Команд\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область КомандыФормы

&НаКлиенте
Процедура ДА(Команда)
	Закрыть(КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура НЕТ(Команда)
	Закрыть(КодВозвратаДиалога.Нет);
КонецПроцедуры

#КонецОбласти

/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////Обработчики Событий Элементов\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область ЭлементыФормы

#КонецОбласти

/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////////////////Служебные методы\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область Служебные

#КонецОбласти

///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////Для удаления\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

#Область ДляУдаления

#КонецОбласти

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////////
//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Для удаления/////////////////////////////
//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////////