Функция ПолучитьИменаКолонокИсключенийДляТаблицы(ИмяТаблицы) ЭКСПОРТ
	
	ИменаКолонокИсключений = новый Массив;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ИмяТаблицы",СокрЛП(ИмяТаблицы));
	Запрос.Текст = "ВЫБРАТЬ
	|	Tester_ДопСведенияШаблонныхДанных.ИменаКолонокИсключений КАК ИменаКолонокИсключений
	|ИЗ
	|	РегистрСведений.Tester_ДопСведенияШаблонныхДанных КАК Tester_ДопСведенияШаблонныхДанных
	|ГДЕ
	|	Tester_ДопСведенияШаблонныхДанных.ИмяТаблицы = &ИмяТаблицы";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		ИменаКолонокИсключений = СтрРазделить(Выборка.ИменаКолонокИсключений,";",Ложь);	
	КонецЕсли;
		
	Возврат ИменаКолонокИсключений;	
КонецФункции

Функция ПолучитьМетодЗапросаКТаблице(ИмяТаблицы) ЭКСПОРТ
	
	ИмяМетода = "";
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ИмяТаблицы",СокрЛП(ИмяТаблицы));
	Запрос.Текст = "ВЫБРАТЬ
	|	Tester_ДопСведенияШаблонныхДанных.МетодЗапросаКТаблице КАК МетодЗапросаКТаблице
	|ИЗ
	|	РегистрСведений.Tester_ДопСведенияШаблонныхДанных КАК Tester_ДопСведенияШаблонныхДанных
	|ГДЕ
	|	Tester_ДопСведенияШаблонныхДанных.ИмяТаблицы = &ИмяТаблицы";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		ИмяМетода = Выборка.МетодЗапросаКТаблице;	
	КонецЕсли;
		
	Возврат ИмяМетода;	
КонецФункции	