Функция ПолучитьТекстЗапросаДляВыбораШаблонныхДанных(ВыбиратьШаблонныеДанные) ЭКСПОРТ
	ТекстЗапроса = "ВЫБРАТЬ
	|	Tester_ШаблонныеДанные.ПредставлениеUID КАК ЗначениеВыбора,
	|	Tester_ШаблонныеДанные.НаименованиеШаблона КАК Наименование
	|ИЗ
	|	РегистрСведений.Tester_ШаблонныеДанные КАК Tester_ШаблонныеДанные
	|ГДЕ
	|	&ЭтоШаблоннаяСхема
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Если ВыбиратьШаблонныеДанные = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоШаблоннаяСхема","ИСТИНА"); 
	ИначеЕсли ВыбиратьШаблонныеДанные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоШаблоннаяСхема","Tester_ШаблонныеДанные.ЭтоШаблоннаяСхема");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоШаблоннаяСхема","НЕ Tester_ШаблонныеДанные.ЭтоШаблоннаяСхема");
	КонецЕсли;
				
	Возврат ТекстЗапроса;
КонецФункции	


