
/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////Обработчики Событий Формы \\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок = ?(Параметры.Свойство("ЗаголовокФормы",Заголовок),Заголовок,"ОтображениеТаблицы");
	РучнойВводЗапроса = ?(Параметры.Свойство("РучнойВводЗапроса",РучнойВводЗапроса),РучнойВводЗапроса,Истина);
	ПереданнаяТаблица = ?(Параметры.Свойство("ТаблицаДляОтображения",ПереданнаяТаблица),ПереданнаяТаблица,Неопределено);
	СтруктураЗапроса = ?(Параметры.Свойство("СтруктураЗапроса",СтруктураЗапроса),СтруктураЗапроса,новый Структура);
	
	ТекстЗапроса = ?(СтруктураЗапроса.Свойство("ТекстЗапроса",ТекстЗапроса),ТекстЗапроса,"");
	СтруктураПараметровЗапроса = ?(СтруктураЗапроса.Свойство("СтруктураПараметровЗапроса",СтруктураПараметровЗапроса),СтруктураПараметровЗапроса,новый Структура);
	СтруктураЗаменяемыхЗначений = ?(СтруктураЗапроса.Свойство("СтруктураЗаменяемыхЗначений",СтруктураЗаменяемыхЗначений),СтруктураЗаменяемыхЗначений,новый Структура);
	
	Если РучнойВводЗапроса Тогда		
		
		Для каждого ПараметрЗапроса из СтруктураПараметровЗапроса Цикл
			нСтрока = ПараметрыЗапроса.Добавить();
			нСтрока.ИмяПараметра = ПараметрЗапроса.Ключ;
			нСтрока.ЗначениеПараметра = ПараметрЗапроса.Значение; 
		КонецЦикла;
		
		ПереключитьсяНаЭкран(ЭтаФорма,"ДанныеЗапроса");
	Иначе		
		
		Если ПереданнаяТаблица = Неопределено Тогда
			РезультатЗапросаТаблицы = КиурСрв.ПолучитьРезультатПроизвольногоТекстаЗапроса(ТекстЗапроса,СтруктураПараметровЗапроса,СтруктураЗаменяемыхЗначений);
			ТаблицаЗначений = РезультатЗапросаТаблицы.Выгрузить();
		Иначе
			ТаблицаЗначений = ПереданнаяТаблица.Выгрузить();	
		КонецЕсли;	
		
		КиурСрв.ДобавитьПроизвольнуюТаблицуНаФорму("ТаблицаДляОтображения",ЭтаФорма,ТаблицаЗначений,Элементы.ОтображениеТаблицы);		
		
		ПереключитьсяНаЭкран(ЭтаФорма,"ОтображениеТаблицы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Активизировать();
КонецПроцедуры

#КонецОбласти


/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////Обработчики Событий Команд\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область КомандыФормы 

&НаКлиенте
Процедура ПолучитьРезультатЗапроса(Команда)
	ВывестиРезультатЗапросаНаФорму();
	ПереключитьсяНаЭкран(ЭтаФорма,"ОтображениеТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуСТаблицей(Команда)
	//@skip-check wrong-string-literal-content
	Закрыть(ЭтаФорма["ТаблицаДляОтображения"]);
КонецПроцедуры

#КонецОбласти

/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////Обработчики Событий Элементов\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область ЭлементыФормы

#КонецОбласти

/////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////////////////Служебные методы\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область Служебные

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьсяНаЭкран(ФормаЭкранов,ИмяЭкрана)
	ФормаЭкранов.Элементы.Экраны.ТекущаяСтраница = ФормаЭкранов.Элементы[ИмяЭкрана];
	
	Если ИмяЭкрана = "ОтображениеТаблицы" Тогда
		ФормаЭкранов.Элементы.ТаблицаДляОтображения.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРезультатЗапросаНаФорму()
	СтруктураПараметровЗапроса = новый Структура;	
	
	Для каждого стр из ПараметрыЗапроса Цикл
		СтруктураПараметровЗапроса.Вставить(стр.ИмяПараметра,стр.ЗначениеПараметра);	
	КонецЦикла;
	
	РезультатЗапросаТаблицы = КиурСрв.ПолучитьРезультатПроизвольногоТекстаЗапроса(ТекстЗапроса,СтруктураПараметровЗапроса);
	ТаблицаЗначений = РезультатЗапросаТаблицы.Выгрузить();
	КиурСрв.ДобавитьПроизвольнуюТаблицуНаФорму("ТаблицаДляОтображения",ЭтаФорма,ТаблицаЗначений,Элементы.ОтображениеТаблицы);
КонецПроцедуры



#КонецОбласти

///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////////Для удаления\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

#Область ДляУдаления

#КонецОбласти

//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////////
//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Для удаления/////////////////////////////
//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////////