#Область Отладка

//@skip-check redundant-export-method
Функция ТестПроцедураКарты(Знач ФиксированныеПараметры, МодифицируемыеПараметры) ЭКСПОРТ
	Запрос = новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
					|	ТаблицаКарт.*
					|ИЗ
					|	Справочник.Карты КАК ТаблицаКарт";
	
	ИтоговаяТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Успешно = Истина;

	МодифицируемыеПараметры.Вставить("Успешно",Успешно);	
//	МодифицируемыеПараметры.Вставить("ИтоговаяТаблицаЗначений",ИтоговаяТаблицаЗначений);	
	Возврат Успешно;
КонецФункции	

#КонецОбласти
