#Область Отладка

Функция ЭтоСлужебнаяТаблицаТестируемойБазы(ИмяТаблицы) ЭКСПОРТ
	
	ИмяОсновнойТаблицы = СтрРазделить(ИмяТаблицы,".",Ложь);
	
	Если ИмяОсновнойТаблицы.Количество() >= 2 Тогда
		ИмяОсновнойТаблицы = ИмяОсновнойТаблицы[0] + "." + ИмяОсновнойТаблицы[1];	
	Иначе
		ИмяОсновнойТаблицы = ИмяТаблицы;
	КонецЕсли;		 
	
	Запрос = новый Запрос;
	ЗАпрос.УстановитьПараметр("ИмяТаблицы",ИмяОсновнойТаблицы);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Tester_СлужебныеТаблицы.ИмяТаблицы КАК ИмяТаблицы
	               |ИЗ
	               |	РегистрСведений.Tester_СлужебныеТаблицы КАК Tester_СлужебныеТаблицы
	               |ГДЕ
	               |	Tester_СлужебныеТаблицы.ИмяТаблицы = &ИмяТаблицы";
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Процедура ПримерМетодаЗагрузкиXML_С_ДопОбработкой(Знач ФиксированныеПараметры, МодифицируемыеПараметры)
	Если НЕ TesterСрв.ВыполненаШаблоннаяЗагрузкаXMLДляПостОбработки(ФиксированныеПараметры, МодифицируемыеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	//
	//Что-делаем дополнительно кодом.
	// МодифицируемыеПараметры.Успешно уже = Истина после ВыполненаШаблоннаяЗагрузкаXMLДляПостОбработки
	//При необходимости переопределяем в ложь конце метода 
	//	
	
КонецПроцедуры

Процедура ПримерМетодаИндивидуальногоЗапросаКТаблице(Знач ФиксированныеПараметры, МодифицируемыеПараметры)
	ТекстВыборкиДополнительныхПолейВТаблицу = "," + Символы.ПС + Символы.Таб + "ДопТаблица.ДопПоле КАК ДопПоле" + Символы.ПС;
	ТекстСоединенийСДопТаблицами = "" + Символы.Таб + Символы.Таб + "ВНУТРЕНЕЕЕ СОЕДИНЕНИЕ КакойТоТипТаблицы.КакаяТоТаблица КАК ДопТаблица" + Символы.ПС;
	ТекстСоединенийСДопТаблицами = ТекстСоединенийСДопТаблицами + Символы.Таб + Символы.Таб + "ПО ОсновнаяТаблица.КлючевоеПоле = ДопТаблица.КлючевоеПоле";
	
	МодифицируемыеПараметры.Вставить("ТекстВыборкиДополнительныхПолейВТаблицу",ТекстВыборкиДополнительныхПолейВТаблицу);
	МодифицируемыеПараметры.Вставить("ТекстСоединенийСДопТаблицами",ТекстСоединенийСДопТаблицами);
	
	TesterСрв.ВыполненШаблонныйЗапросКТаблицеБД(ФиксированныеПараметры, МодифицируемыеПараметры);
	
КонецПроцедуры	
		


#КонецОбласти
