#Область Отладка

//@skip-check redundant-export-method
Функция ТестПроцедураКарты(Знач ФиксированныеПараметры, МодифицируемыеПараметры) ЭКСПОРТ
	Запрос = новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
					|	ТаблицаКарт.*
					|ИЗ
					|	Справочник.Карты КАК ТаблицаКарт";
	
	ИтоговаяТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Успешно = Истина;

	МодифицируемыеПараметры.Вставить("Успешно",Успешно);	
//	МодифицируемыеПараметры.Вставить("ИтоговаяТаблицаЗначений",ИтоговаяТаблицаЗначений);	
	Возврат Успешно;
КонецФункции	

Функция ЭтоСлужебнаяТаблицаТестируемойБазы(ИмяТаблицы) ЭКСПОРТ
	
	ИмяОсновнойТаблицы = СтрРазделить(ИмяТаблицы,".",Ложь);
	
	Если ИмяОсновнойТаблицы.Количество() >= 2 Тогда
		ИмяОсновнойТаблицы = ИмяОсновнойТаблицы[0] + "." + ИмяОсновнойТаблицы[1];	
	Иначе
		ИмяОсновнойТаблицы = ИмяТаблицы;
	КонецЕсли;		 
	
	Запрос = новый Запрос;
	ЗАпрос.УстановитьПараметр("ИмяТаблицы",ИмяОсновнойТаблицы);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Tester_СлужебныеТаблицы.ИмяТаблицы КАК ИмяТаблицы
	               |ИЗ
	               |	РегистрСведений.Tester_СлужебныеТаблицы КАК Tester_СлужебныеТаблицы
	               |ГДЕ
	               |	Tester_СлужебныеТаблицы.ИмяТаблицы = &ИмяТаблицы";
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти
