Функция ПолучитьСоединение(ФиксированныеПараметры, МодифицируемыеПараметры = Неопределено) ЭКСПОРТ
	
	Если ТипЗнч(МодифицируемыеПараметры) <> Тип("Структура") Тогда
		МодифицируемыеПараметры = новый Структура;
	КонецЕсли;
			
	ЭлементСоединения = ФиксированныеПараметры.ЭлементСоединения;
	
	Если НЕ ЗначениеЗаполнено(ЭлементСоединения) ИЛИ ТипЗнч(ЭлементСоединения) <> Тип("СправочникСсылка.Киур_СоединенияADODB") Тогда
		СообщениеОшибки = "Неопределен элемент соединения.";
		МодифицируемыеПараметры.Вставить("СообщениеОшибки",СообщениеОшибки);
		Возврат Неопределено;
	КонецЕсли;
				
	SQLConnect = Неопределено;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЭлементСоединения",ЭлементСоединения);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоединенияADODB.*
				   |ИЗ
				   |	Справочник.Киур_СоединенияADODB КАК СоединенияADODB
				   |ГДЕ
				   |	СоединенияADODB.Ссылка = &ЭлементСоединения";
	ТЗ_Запроса = Запрос.Выполнить().Выгрузить();
	ЗначенияСоединения = ТЗ_Запроса[0];	
	
	ПараметрыСоединения = новый Структура;
	
	Для каждого Колонка из ТЗ_Запроса.Колонки Цикл
		ПараметрыСоединения.Вставить(Колонка.Имя,ЗначенияСоединения[Колонка.Имя]);	
	КонецЦикла;	
	
	ПараметрыСоединения = новый ФиксированнаяСтруктура(ПараметрыСоединения);
	
	Попытка
		SQLConnect = КиурКлСрв.	ПолучитьADODB_СоединениеС_БД(ПараметрыСоединения);
	Исключение
		СообщениеОшибки = ОписаниеОшибки();
		МодифицируемыеПараметры.Вставить("СообщениеОшибки",СообщениеОшибки);
		Возврат Неопределено;
	КонецПопытки;		
	
	Возврат SQLConnect;			   
	
КонецФункции	